# create dataframe

In [2]:
import pandas as pd

import numpy as np

In [4]:
df = pd.read_csv("data/weather_data.csv")
df

           day  temperature  windspeed  event
0   2025-01-01          NaN       12.0    NaN
1   2025-01-02         33.0        NaN   snow
2   2025-01-03         27.0        NaN    NaN
3   2025-01-04         30.0       10.0  sunny
4   2025-01-05          NaN        NaN   rain
..         ...          ...        ...    ...
56  2025-02-26         32.0        NaN   rain
57  2025-02-27         30.0       23.0   snow
58  2025-02-28         20.0       21.0   rain
59  2025-03-01          NaN        6.0   snow
60  2025-03-02         24.0        NaN  sunny

[61 rows x 4 columns]

In [8]:
df = pd.DataFrame({'Name': ['Alice', 'Bob', 'Aritra'],
                   'Age': [25, 30, 35],
                   'Location': ['Seattle', 'New York', 'Kona']},
                  index=([10, 20, 30]))
df

      Name  Age  Location
10   Alice   25   Seattle
20     Bob   30  New York
30  Aritra   35      Kona

In [9]:
df = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
print(df)
print(df.columns)
print(df.index)

   A  B
0  1  3
1  2  4
Index(['A', 'B'], dtype='object')
RangeIndex(start=0, stop=2, step=1)

In [10]:


cat = pd.Categorical(["a", "c", "c", np.nan], categories=["b", "a", "c"])

df = pd.DataFrame({"cat": cat, "s":["a", "c", "c", np.nan]})

print(df.describe())

print(df["cat"].describe())

       cat  s
count    3  3
unique   2  2
top      c  c
freq     2  2
count     3
unique    2
top       c
freq      2
Name: cat, dtype: object

In [11]:
df = pd.read_csv("weather_data_2.csv",index_col = 1) # set the  1th column as index 
df

                  day windspeed     event
temperature
32C          1/1/2017      6mph      Rain
-99999       1/2/2017         7     Sunny
28           1/3/2017    -99999      Snow
-99999       1/4/2017     7kmph  no event
32F          1/5/2017    -99999      Rain
31           1/6/2017         2     Sunny
34           1/6/2017         5  no event

In [12]:
df.reset_index(inplace=True)
df

  temperature       day windspeed     event
0         32C  1/1/2017      6mph      Rain
1      -99999  1/2/2017         7     Sunny
2          28  1/3/2017    -99999      Snow
3      -99999  1/4/2017     7kmph  no event
4         32F  1/5/2017    -99999      Rain
5          31  1/6/2017         2     Sunny
6          34  1/6/2017         5  no event

In [13]:
df[4:7]

  temperature       day windspeed     event
4         32F  1/5/2017    -99999      Rain
5          31  1/6/2017         2     Sunny
6          34  1/6/2017         5  no event

# SLICING IN DATA FRAME

In [14]:
df.iloc[:,3] # all row 3rd column

0        Rain
1       Sunny
2        Snow
3    no event
4        Rain
5       Sunny
6    no event
Name: event, dtype: object

In [15]:
df.iloc[4:5,1:3] # row 4 to 5 , cloumn 1 to 3

        day windspeed
4  1/5/2017    -99999

In [16]:
dff = pd.read_json("json_data.json")
dff

                                            json_data
0   {'fruit_id': 1, 'fruit_name': 'Apple', 'temper...
1   {'fruit_id': 2, 'fruit_name': 'Banana', 'tempe...
2   {'fruit_id': 3, 'fruit_name': 'Orange', 'tempe...
3   {'fruit_id': 4, 'fruit_name': 'Mango', 'temper...
4   {'fruit_id': 5, 'fruit_name': 'Grapes', 'tempe...
5   {'fruit_id': 6, 'fruit_name': 'Apple', 'temper...
6   {'fruit_id': 7, 'fruit_name': 'Banana', 'tempe...
7   {'fruit_id': 8, 'fruit_name': 'Orange', 'tempe...
8   {'fruit_id': 9, 'fruit_name': 'Mango', 'temper...
9   {'fruit_id': 10, 'fruit_name': 'Grapes', 'temp...
10  {'fruit_id': 11, 'fruit_name': 'Apple', 'tempe...
11  {'fruit_id': 12, 'fruit_name': 'Banana', 'temp...
12  {'fruit_id': 13, 'fruit_name': 'Orange', 'temp...
13  {'fruit_id': 14, 'fruit_name': 'Mango', 'tempe...
14  {'fruit_id': 15, 'fruit_name': 'Grapes', 'temp...

In [17]:
display(dff)

                                            json_data
0   {'fruit_id': 1, 'fruit_name': 'Apple', 'temper...
1   {'fruit_id': 2, 'fruit_name': 'Banana', 'tempe...
2   {'fruit_id': 3, 'fruit_name': 'Orange', 'tempe...
3   {'fruit_id': 4, 'fruit_name': 'Mango', 'temper...
4   {'fruit_id': 5, 'fruit_name': 'Grapes', 'tempe...
5   {'fruit_id': 6, 'fruit_name': 'Apple', 'temper...
6   {'fruit_id': 7, 'fruit_name': 'Banana', 'tempe...
7   {'fruit_id': 8, 'fruit_name': 'Orange', 'tempe...
8   {'fruit_id': 9, 'fruit_name': 'Mango', 'temper...
9   {'fruit_id': 10, 'fruit_name': 'Grapes', 'temp...
10  {'fruit_id': 11, 'fruit_name': 'Apple', 'tempe...
11  {'fruit_id': 12, 'fruit_name': 'Banana', 'temp...
12  {'fruit_id': 13, 'fruit_name': 'Orange', 'temp...
13  {'fruit_id': 14, 'fruit_name': 'Mango', 'tempe...
14  {'fruit_id': 15, 'fruit_name': 'Grapes', 'temp...

In [21]:
dff.sum(numeric_only=True)

Series([], dtype: float64)

  temperature       day windspeed     event
0         32C  1/1/2017      6mph      Rain
1      -99999  1/2/2017         7     Sunny
2          28  1/3/2017    -99999      Snow
3      -99999  1/4/2017     7kmph  no event
4         32F  1/5/2017    -99999      Rain
5          31  1/6/2017         2     Sunny
6          34  1/6/2017         5  no event